In [1]:
import pandas as pd
import numpy as np
from pydataset import data

# pip install pydataset (in your terminal then restart notebook)

Create Series

In [2]:
my_list = [2,3,5]
type(my_list)

list

In [3]:
my_series = pd.Series(my_list)

In [4]:
my_series

0    2
1    3
2    5
dtype: int64

In [5]:
my_array = np.array(my_list)
my_array

array([2, 3, 5])

In [6]:
my_series = pd.Series(my_array)
my_series

0    2
1    3
2    5
dtype: int64

In [7]:
my_df = data('sleepstudy')

In [8]:
my_df.head()

   Reaction  Days  Subject
1  249.5600     0      308
2  258.7047     1      308
3  250.8006     2      308
4  321.4398     3      308
5  356.8519     4      308

In [9]:
my_series = my_df.Reaction

In [10]:
my_series

1      249.5600
2      258.7047
3      250.8006
4      321.4398
5      356.8519
         ...
176    329.6076
177    334.4818
178    343.2199
179    369.1417
180    364.1236
Name: Reaction, Length: 180, dtype: float64

In [11]:
type(my_series)

pandas.core.series.Series

In [12]:
my_series = my_df['Reaction']

In [13]:
my_series

1      249.5600
2      258.7047
3      250.8006
4      321.4398
5      356.8519
         ...
176    329.6076
177    334.4818
178    343.2199
179    369.1417
180    364.1236
Name: Reaction, Length: 180, dtype: float64

In [14]:
my_series = my_df[['Reaction']]
my_series

     Reaction
1    249.5600
2    258.7047
3    250.8006
4    321.4398
5    356.8519
..        ...
176  329.6076
177  334.4818
178  343.2199
179  369.1417
180  364.1236

[180 rows x 1 columns]

In [15]:
make_df = {'Name': ['Tom','Bob','Timmy','Jack'],
     'Age': [22,24,25,34]
     }

In [16]:
make_df = pd.DataFrame(make_df)

In [17]:
make_df

    Name  Age
0    Tom   22
1    Bob   24
2  Timmy   25
3   Jack   34

In [18]:
my_new_series = my_series.astype('int')

In [19]:
my_new_series

     Reaction
1         249
2         258
3         250
4         321
5         356
..        ...
176       329
177       334
178       343
179       369
180       364

[180 rows x 1 columns]

In [20]:
my_df['Subject'].astype('str')

1      308
2      308
3      308
4      308
5      308
      ...
176    372
177    372
178    372
179    372
180    372
Name: Subject, Length: 180, dtype: object

In [23]:
vowels = list('aeiouy')
letters = list('abcdefghijklmnopqrstuvwxyz')

In [25]:
letters_series = pd.Series(letters)
letters_series.isin(vowels)

0      True
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8      True
9     False
10    False
11    False
12    False
13    False
14     True
15    False
16    False
17    False
18    False
19    False
20     True
21    False
22    False
23    False
24     True
25    False
dtype: bool

In [26]:
letters_series.count()

26

In [28]:
vowels_series = pd.Series(vowels)
vowels_series.isin(letters_series)

0    True
1    True
2    True
3    True
4    True
5    True
dtype: bool

In [29]:
letters_series.describe()

count     26
unique    26
top        a
freq       1
dtype: object

In [33]:
my_new_series.show

AttributeError: 'DataFrame' object has no attribute 'show'